import React, { Component } from 'react';

import './adoption_tips.css';
import Head from '../../components/head/head.js';

export default class AdoptionTips extends Component {
  render() {
    return(
      <div className='adoption-tips-container'>
        <Head />
        无论猫，狗，或者其他宠物，从你选择了它的那一刻开始，就相当于对它许下了一个承诺，十几年的时间，对于我们可能只是一个人生的阶段，但对于它们而言，则是生命全部。
        可以不爱，请勿伤害！这不仅仅是呼吁，更需要去行动。
        一份承诺加一份爱，它们的幸福就是如此的简单。
        倍感幸运的是，通过今日一线以及南方都市报等媒体的报道，不少热心人能了解到我们并关注我们宠回家。
        但深感抱歉的是我们作为义工只能利用业余时间去管理和回复通过公众号后台询问的问题，为了不错过任何一个能让狗狗找到它们的家的机会，以下是我们从后台搜集到的一些比较常见的问题。
        <ul>
          <li>
            <h2>1、我想领养宠物，我需要什么条件吗？</h2>
            <p>答：我们希望您能有一定的经济基础，可以提供一个比较稳定的居住场所和适当的宠物活动空间。</p>
            <p>保证宠物的安全，不把宠物用于商业用途。</p>
            <p>如果你是学生的话，领养需由家长代为申请。</p>
          </li>
          <li>
            <h2>2、领养了宠物之后，我需要做些什么？</h2>
            <p>答：善待它们，坚持科学喂养。</p>
            <p>带宠物出门必须做好安全措施，狗要牵绳，猫用猫包。</p>
            <p>请依法进行养犬登记和做绝育手术，绝育是为了它们更健康，希望得到你的认同。并且每年对宠物进行定期免疫、驱虫等。同时不给宠物施行不必要的手术。</p>
            <p>宠物生病的时候，可以随时咨询我们，在必要时，请给它们提供医疗措施，我们会提供帮助。</p>
          </li>
          <li>
            <h2>3、领养宠物之前，我需要准备什么？</h2>
            <p>答：事先与家人做好沟通及商议，认真考虑并避免以后可能出现的家人的反对、婚姻、生育、工作变动、宠物不听话、宠物生病等原因而导致遗弃宠物的可能性。</p>
            <p>在领养猫前需要把窗和阳台封上细铁网，以防止猫逃跑或者失足坠楼的可能。</p>
          </li>
          <li>
            <h2>4、如果无法再继续喂养宠物，我该怎么办？</h2>
            <p>答：当你无法继续喂养宠物时，请将宠物交回给我们，我们将帮它重新找一个家。</p>
          </li>
          <li>
            <h2>5、如果宠物走失，我该怎么办</h2>
            <p>答：如不幸走失，请马上联系我们，我们会协助你发布信息和寻找。</p>
          </li>
          <li>
            <h2>6、我符合以上条件，该怎么领养宠物？</h2>
            <p>答：公众号后台菜单点击最右面 联系我们 -> 官方微信，或者扫描文章底部宠回家微信号二维码添加官方微信，如果你达到了我们初步审核的要求，我们将会和你预约时间前往基地相看合眼的宠物。</p>
          </li>
        </ul>
      </div>
    )
  }
}